<template>
  <div>
    <nav-bar></nav-bar>
    <div class="agreement">
      <p class="title">{{content.title}}</p>
      <p class="first-title">{{content.firstTitle}}</p>
      <p class="normal-text">{{content.tip}}</p>
      <div v-for="(item,index) in content.detail" :key="index">
        <p class="first-title">{{item.title}}</p>
        <p class="normal-text" v-for="(text,index) in item.content" :key="index">{{text}}</p>
      </div>
    </div>
  </div>
</template>

<script>
import navBar from "@/components/NavBar";

export default {
  name: "Agreement",
  components: {
    navBar,
  },
  data() {
    return {
      content: {
        title: "服务协议",
        firstTitle:
          "使用说客英语（Talk915.com）服务即视为同意以下用户服务协议。",
        tip:
          "在您（以下简称“用户”）下载、安装或使用说客英语APP产品及任何随附的文档（如有），包括提供给用户的更新或升级版本（依据本协议之外的其他协议提供给用户的更新或升级版本除外）（下文统称“说客英语”）之前，请用户务必仔细阅读本协议中约定的下述条款除非用户与深圳青豆教育科技有限公司（以下简称“公司”）就说客英语的使用另外签署了其他协议，否则用户对说客英语的使用受本《说客英语用户服务协议》（以下简称“本协议”）中各项条款的约束。请用户仔细阅读以下条款，在用户同意并接受本协议全部条款的前提下，公司将说客英语的合法使用授权授予用户。如果用户是未成年人，则请用户在法定监护人陪同下审阅和判断是否同意本协议，未成年人使用说客英语的行为视为已获得了法定监护人的认可。如果用户不同意接受本协议的全部条款，则用户无权注册、登录或使用本协议所涉及服务，用户下载、安装、使用说客英语等行为，则意味着用户将自愿遵守本协议及说客英语的其他有关规则，并完全服从于说客英语的统一管理。说客英语有权根据业务需要对本协议不定时进行调整，并将调整后的协议公布于公司官网或者说客英语APP中，如果用户不同意调整后的本协议的，用户应当停止使用说客英语，否则，如果在公司调整本协议并公布后，用户继续使用说客英语提供的服务的，则视为用户同意遵守调整后的协议。",
        detail: [
          {
            title: "一. 服务介绍",
            content: [
              "1. 用户须通过合法渠道（包括但不限于各大应用市场、说客英语官网）下载、安装并使用说客英语，这是您获得说客英语使用授权的前提；",
              "2. 说客英语提供的各项服务的所有权和运作权归本站说客英语所有。说客英语将根据实际提供服务，并按照说客英语发布的服务条款和操作规则严格执行；",
              "3. 用户必须完全接受本服务条款的全部内容，并完成注册程序，才能成为说客英语的注册用户，享受本站的相关服务；",
              "4. 用户自备上网所需要的设备，自行承担上网产生的各项费用；",
              "5. 用户需提供上课所需的详尽、准确的个人资料并及时更新；",
              "6. 用户必须遵守中华人民共和国的法律、法规、规章、条例、以及其他具有法律效力的规范，不使用网络服务做非法用途。",
            ],
          },
          {
            title: "二. 套餐有效期",
            content: [
              "特别提醒： 套餐为有效期产品，有效期每月按30天计算，有效期内须学完所有课时，过期不退不补;",
              "例：40课时（6个月有效），实际有效期为6*30天=180天;",
              "再次购买同类型套餐有效期会叠加。例如：已有次卡，再购入次卡会叠加两者有效期。",
              "1.次卡：",
              "①.从充值当天开始计算有效期。",
              "②.有效期内可自助延期一次。延长天数=套餐有效期天数*20%，不满1天按1天算。",
              "③.有效期内必须学完所有课时，过期不退不补。",
              "2.月卡：",
              "①.月卡自用户购买之日的次日起计七天后自动激活。激活后第二天开始，必须每天至少上一节课，当天如未上课，系统会强制性扣除1课时。 老师原因当天被取消课程的除外。注：月卡使用过程中，每天至少上一节课，和预约的教师类别无关；比如：1个月月卡（30天有效）， 如果约欧美老师，每节课扣3课时，那么10天就学完了",
              "②.老师原因当天被取消课程的，系统不会再强制性扣点，该课程的有效期顺延1天。非当天被取消的（如续课失败，提前至少1天被取消），当天都需要另约课程上课。",
              "③.若套餐自动激活时间有变更，以您购买时的激活时间为准。",
              "3.周卡：",
              "①.从充值当天开始计算，周卡90天内未手动激活，系统会于第91天自动激活套餐。",
              "②.周卡的有效期较短，我们建议您一周至少上五节课，避免过期造成浪费。",
              "③.有效期内可自助延期一次。延长天数=套餐有效期天数*20%，不满1天按1天算。",
              "④.若套餐自动激活时间有变更，以您购买时的激活时间为准。",
            ],
          },
          {
            title: "三.课程使用须知",
            content: [
              "1.电脑上课需使用谷歌浏览器（80版本以上）或者火狐浏览器（79版本以上），手机和IPAD设备需下载说客英语APP进行上课。",
              "2.为保证用户权益，用户遇到课堂问题（出勤、投诉、补偿课时等）需要申诉，请在十天内提出，超过十天将无法核实处理，此时说客英语有权视为用户已放弃该次申诉和补偿权益。",
              "3.上课过程中请注重仪容仪表，着装整洁，做到尊敬师长，态度端正，保持环境安静，网络正常，尽量配合教师的教学进度，若出现严重干扰授课秩序的情况，教师有权终止授课。",
              "4.一对一课程用户取消必须至少提前2小时，2小时内不接受任何原因的取消。公开课在课程开始前均可取消。",
              "5.教师2小时内取消的，会另外补偿用户100积分。",
              "6.请确保1对1上课过程中只有一名用户参加，超过人数时教师有权拒绝授课。",
              "7.请勿使用聊天工具传送与本节课无关的整本教材或其他大容量文件给教师。",
              "8.未到上课时间，请勿提前呼叫教师，以免影响其他课程的正常进行；在非上课时间，教师因备课、时差等原因可能无法及时回复用户信息。",
              "9.评论和打分请以当节课的情况为依据，请勿出现人身攻击、不雅用语等言行，若出现不文明言行，说客英语保留追究其法律责任和取消其预约该教师课程的权利。",
              "10.为保证每一位用户的约课权益，请勿频繁取消预约（包括VIP预约）或恶意占位抢课，经数据监控系统识别，说客英语保留取消其预约该老师课程的权利。",
            ],
          },
          {
            title: "四.课时补偿规则",
            content: [
              "存在以下情形时，说客英语将对用户课时进行补偿：",
              "1.老师因为网络或设备问题未上满时间，以客服核实回复为准；",
              "2.运营商网络故障，可以补偿；",
              "3.老师问题要求补偿的以最终核实回复为准；",
              "4.其他问题补偿以最终核实回复为准；",
              "特别提示：如发生上述需补偿情况，请用户在该次课时结束之日起十天内反馈，如超时反馈将按照本协议第三条第2款约定按不予补偿处理。",
              "存在以下情形时，说客英语无须对用户课时进行补偿：",
              "1、用户密码输入问题登录不上的不补偿；",
              "2、用户忘记取消、临时停电等不补偿；",
              "3、用户个人原因缺勤（包含缺勤未收到迟到提醒），一律不补偿；",
              "4、用户使用不支持的浏览器不补偿（推荐使用谷歌浏览器80以上版本，火狐浏览器79以上版本）；",
              "5、用户自己网络问题不补偿；",
              "6、用户设备故障问题不补偿；",
              "7、用户忘记修改教材/约了上过的教材不补偿；",
              "8、老师摄像头问题，语音继续上满了整节课，视为用户接受上课，不补偿；",
            ],
          },
          {
            title: "五. 退费规则",
            content: [
              "用户购买课程后，若确认不再继续使用说客英语服务，需要退费的，按以下规定申请办理：",
              "1.用户需提供付费凭证，并向购买课程的说客英语校区申请退费。",
              "2.已使用课时扣费：",
              "已使用课时扣费 = 实际付款额 * 已使用课时数 / 套餐课时数",
              "套餐课时数，不包含赠送课时；套餐有效期，不包含赠送课时有效期。",
              "用户明确并同意，赠送的课时（如有）在用户购买的全部课时使用完毕后才会开始使用，赠送的课时不得折算为退款。",
              " 3.服务费:",
              "购买7天内，不收服务费",
              "购买12个月内，服务费按以下方式计算：",
              "服务费=实际付款额*8%+实际付款额*1%*购买时间（购买时间按月为单位计算，不足1个月的部分按1个月计算）。",
              "购买超过12个月，不予退费。",
              " 4.已开具发票的需先返还发票（邮寄方承担邮费，不接受到付），如不能返还发票，将从退款中扣除发票金额的10%（6%的税点及人工处理课税成本）。",
              "5.有赠送教材及礼品的，将按照教材与赠送礼品发放时标示价格从退款中扣除。",
              "6.用户退款 = 实际付款额 - 已使用课时扣款 -服务费 - 未退还发票费（如已开具未退回）- 礼品费（如有）",
              "7.举例说明： 用户购买40课时次卡套餐（有效期90天），实际付款额1800元，赠送5课时，没有其他礼品，也没有开具发票，在用户在购买30天后，使用10课时的情况下，申请退款，按照上述制度标准，退款为：",
              "用户退款 = 实际付款额 - 已使用课时扣费 - 服务费 - 未退还发票费（如已开具未退回）- 礼品费（如有）",
              "= 1800 - 1800 * 10 / 40 - 1800 * 8% -1800 * 1% * 1 - 0（未开发票）- 0（无其他礼品）",
              "= 1188 元",
            ],
          },
          {
            title: "六. 安全与隐私",
            content: [
              "1. 用户一旦注册成功，即成为本站的合法用户。您可随时根据指示变更您的密码。用户有义务妥善保管其在说客英语申请的账号及密码之机密与安全， 不得泄漏给任何第三人。若因用户个人操作不当泄露密码，造成的损失将由本人承担全部后果。本站账号及密码仅限于您个人使用，非经说客英语同意，用户不得出借、移转或让与给其他第三人使用，否则说客英语有权根据实际情况暂时封停或永久查封此账号。当用户的账号或密码遭到未经授权的使用时，用户应当立即通知说客英语，否则未经授权的使用行为均视为用户本人行为。",
              "2. 说客英语十分注重用户隐私，我们将对用户所提供的资料进行严格的管理及保护，防止用户的个人资料丢失、被盗用或遭篡改，未经用户许可之前，说客英语不会把用户的任何个人信息提供给无关的第三方（包括公司或个人），以下情况除外：",
              "①用户同意让第三方共享资料；",
              "②用户同意公开自己个人资料，享受本站提供的产品和服务；",
              "③需要听从法庭传票、法律命令或遵循法律程序；",
              "④发现用户违反了说客英语服务条款或本站其它使用规定。",
            ],
          },
          {
            title: "七. 服务使用规则",
            content: [
              "1. 您理解并保证您在我方平台上传、发布或传输的内容（包括您的账户名称等信息）不含有以下内容：",
              "①反对宪法确定的基本原则的；",
              "②危害国家统一、主权和领土完整的；",
              "③泄露国家秘密、危害国家安全或者损害国家荣誉和利益的；",
              "④煽动民族仇恨、民族歧视，破坏民族团结，或者侵害民族风俗、习惯的；",
              "⑤宣扬邪教、迷信的；",
              "⑥扰乱社会秩序，破坏社会稳定的；",
              "⑦诱导未成年人违法犯罪和渲染暴力、色情、赌博、恐怖活动的；",
              "⑧侮辱或者诽谤他人，侵害公民个人隐私等他人合法权益的；",
              "⑨危害社会公德，损害民族优秀文化传统的；",
              "⑩有关法律、行政法规和国家规定禁止的其他内容。",
              "2. 如果您上传、发布或传输的内容含有以上违反法律法规的信息或内容的，或者侵犯任何第三方的合法权益，您将直接承担以上违法或侵权行为导致的一切不利后果。如因此给我方造成不利后果的， 您应负责消除影响，并且赔偿我方因此导致的一切损失，包括且不限于财产损害赔偿、名誉损害赔偿、律师费、交通费等因维权而产生的合理费用。",
              "3. 如出现恶意攻击，例如： 刷流量、爬取数据、散布垃圾外链等行为，说客英语有权对攻击的IP及账号进行封号或停用，对屡犯不改者，说客英语保留法律诉讼的权利。",
              "4. 用户对发表在说客英语的所有内容独立承担责任，因用户所发表的内容而引发侵权或其他法律纠纷的，用户自行承担一切后果，与说客英语无关。",
            ],
          },
          {
            title: "八. 服务变更与结束",
            content: [
              " 1. 说客英语有权在必要时修改本服务条款以及各单项服务的相关条款。用户在享受说客英语提供的服务时，应当及时查阅了解修改的内容，并自觉遵守本服务条款以及该单项服务的相关条款。",
              "2. 用户有权自行注销说客英语账号，注销后视为说客英语结束对用户的服务。用户注销后再次注册，不再享受说客英语新用户各项福利（包含但不限于积分奖励、课时奖励、用户邀请奖励等），用户同意注销后，说客英语将不再保留用户的信息（包含但不限于个人资料、上课信息、课时等），用户自行注销视为同意以上条例。注销行为操作后无法撤销，无法恢复数据，请用户谨慎申请。",
              "3. 结束用户服务后，用户使用网络服务的权利马上终止。从那时起，用户没有权利，本网站也没有义务传送任何未处理的信息或未完成的服务给用户或第三方。",
            ],
          },
          {
            title: "九. 版权声明",
            content: [
              "1. 公司拥有说客英语的所有权，包括其中的知识产权，如说客英语的文字标识与图片标识。说客英语为用户提供的自主研发的教材，版权均归说客英语所有， 未经授权，用户不得私自将教材转载到其他网站。说客英语受中华人民共和国著作权法的保护，用户不得删除或以其他方式改变说客英语上附带的版权、商标或其他所有权声明或标识。用户不得对说客英语进行反向工程、反向编译或反汇编， 不得试图进行任何获得说客英语源代码的访问或行为，不得发行、出租、信息网络传播、翻译说客英语软件。",
              "2. 说客英语的用户不能侵犯包括他人的著作权在内的知识产权以及其他权利。一旦由于用户的提问、回答、发言发生法律纠纷，其责任在于用户本人，与说客英语及公司无关。",
              "3. 对于用户发表到说客英语上的任何内容，用户同意说客英语在全世界范围内具有免费的、永久性的、不可撤销的、非独家的和完全再许可的权利和许可， 以使用、复制、修改、改编、出版、翻译、据以创作衍生作品、传播、表演和展示此等内容（整体或部分），和/或将此等内容编入当前已知的或以后开发的其他任何形式的作品、媒体或技术中。 并且，用户许可说客英语公司有权利就任何主体侵权而单独采取法律行动（包括但不限于诉讼、举报、律师函等形式）。",
              "4. 说客英语有权对用户发布的内容进行审核，并有权依据法律法规对侵权信息进行处理。说客英语用户的言论侵犯了第三方的著作权或其他权利，第三方提出异议的时候，说客英语有权删除相关的内容， 提出异议者和用户之间以和解、调解、仲裁、诉讼等方式解决了争议后，以此为依据，说客英语在得到有关申请后可以恢复被删除的内容。",
              "5. 用户从说客英语的服务中获得的信息在没有得到事先许可的情况下，自行或提供给第三方利用复制，发送，传播等手段用于盈利目的时，将追究相关当事人的法律责任。",
              "6. 未经本公司事先许可，禁止使用任何机器人、爬虫程序、其他自动设备，或手动程序等来监视或复制说客英语网页或其所包含的任何内容。否则，说客英语有权依法追究法律责任。",
              "7. 如果第三方要使用说客英语上的提问、回答或评论的，则需要事先获得相关用户同意后方能使用。",
            ],
          },
          {
            title: "十. 不保证、不允诺担保、责任有限、免责、不承担损失",
            content: [
              "1. 不保证：说客英语不保证（包括但不限于）：",
              "①本站服务不受干扰，及时、安全、可靠或不出现错误；",
              "②用户经由本站取得的任何产品、服务或其他材料符合用户的期望；",
              "③用户使用经由本站下载的或取得的任何资料，其风险自行负担。",
              "2. 不允诺担保：说客英语用户提问、回答、发言仅代表用户个人观点，与公司无关，且说客英语不对用户发表的回答或评论的正确性、准确性、真实性进行保证。 说客英语为按现状提供，包含瑕疵及缺陷，公司不提供任何其他担保。公司不允诺其他无论是明示的还是默示的保证和担保，包括但不限于对特定目的的适销性和适应性，不侵权，以及任何出自交易过程或商业惯例的保证和条件。 从公司或他处获取的任何建议或信息，不论是口头的还是书面的，都不会对公司产生本协议明确约定之外的其他保证和担保。",
              "3. 责任有限：适用法律所允许的最大范围内，不论出于何种原因，公司对您的全部责任为您为使用说客英语的产品和服务而向公司支付的费用总额。 如果公司免费向您提供了说客英语服务，则公司无义务对您承担任何赔偿责任。任何情况下，公司不对出自本协议或与本协议有关的或与说客英语的运行有关的任何特殊的、偶然的、惩罚性或间接的损害（包括但不限于数据损失、利润损失或营业损失）或采购替代产品承担责任， 不论该等责任是基于合同，担保，侵权（包括过失），严格责任或其他，也不论公司是否被事先告知了损失或损害发生的可能性。即使本协议约定的有限补救措施未能实现其根本目的，前述的责任限制依然适用。",
              "4. 免责：如因下所列任何原因而造成的用户资料泄露、丢失、被盗用或被篡改等，公司均有权获得免责：",
              "（1）任何因政府管制而造成的暂时性关闭等影响网络正常浏览的不可抗力原因；",
              "（2）任何计算机系统问题、黑客攻击、计算机病毒（包括因下载而感染电脑病毒）侵入或发作的原因；",
              "（3）任何因网络安全问题导致的账户或银行卡信息泄露，该风险可能会给用户造成经济损失，用户承诺自行承担向侵权方追究责任及追究责任不能的后果；",
              "（4）任何因用户个人原因导致的用户资料泄露、丢失、被盗用或被篡改等；",
              "（5）其他不能归责于公司的原因。",
              "5. 不承担损失：说客英语注明之服务条款外，其它因使用本站而导致任何意外、疏忽、合约毁坏、诽谤、侵权及其所造成的各种损失，说客英语概不负责，亦不承担任何法律责任。",
            ],
          },
          {
            title: "十一.其他须知",
            content: [
              "1. 用户一经注册或登录使用说客英语，即视为用户同意公司或其关联公司的工作人员与其进行电话或短信联系。用户应填写最新的联系方式，因用户未及时更换联系方式，而导致信息无法送达等问题，由用户本人承担责任。",
              "2. 用户在使用说客英语提供的课程服务过程中及服务结束后，不可唆使、劝诱说客英语（及关系企业）的员工、老师、顾问与说客英语终止或解除服务关系，或由用户自己介绍他人予以雇佣（无论正式、兼职、约聘）的任何职务。如有违反，用户应承担说客英语为填补该职位空缺所支出的合理费用，并应向说客英语承担违约金 （以上述人员离职前上一年度年薪或报酬的三倍计算），违约金不足以弥补损失的，说客英语有权要求用户予以补足。",
              "3. 说客英语有权根据法律法规的变化及网站运营的需要对本协议及本站的内容进行修改，修改后的协议一旦被张贴在本站上即生效，并代替原来的协议，用户可随时登录查阅最新协议。用户有义务及时关注并阅读最新版的协议及网站公告。如用户不同意更新后的协议，可以立即向说客英语进行反馈且应立即停止接受说客英语依据本协议提供的服务；如用户继续使用本站提供的服务，即视为同意更新后的协议。",
              "4. 如果网站更新的规则有冲突的，以时间最新的通知为准。",
              "5. 本协议的签订、生效、履行、争议的解决均适用中华人民共和国法律。",
              "6. 有关本协议的争议应通过友好协商解决，如果协商不成，该争议将提交公司所在地有管辖权的法院诉讼解决。",
              "7. 用户对说客英语的意见及建议可通过在线客服进行反馈。",
              "8. 特别提示：深圳青豆教育科技有限公司对于上述协议内容拥有解释权和修订权。",
            ],
          },
        ],
      },
    };
  },
  methods: {},
};
</script>

<style scoped lang="less">
  .agreement {
    padding-top: 3rem;
    margin: 1rem 1rem;

    .title {
      font-size: 1.867rem;
      color: #333333;
      line-height: 1.867rem;
      margin-bottom: 2.133rem;
      text-align: justify;
      font-weight: 700;
    }

    .first-title {
      font-size: 1.067rem;
      color: #333333;
      line-height: 1.5rem;
      text-align: justify;
      margin-bottom: 1.667rem;
      margin-top: 1.667rem;
      font-weight: 700;
    }

    .normal-text {
      font-size: 0.933rem;
      font-weight: 400;
      color: #606266;
      line-height: 1.333rem;
      text-align: justify;
      margin-bottom: 1rem;
    }
  }
</style>
