<template>
  <div>
    <nav-bar></nav-bar>
    <div class="agreement">
      <p class="title">{{ content.title }}</p>
      <p class="normal-text">{{ content.tip }}</p>
      <div v-for="(item, index) in content.detail" :key="index">
        <p class="first-title">{{ item.title }}</p>
        <p
          class="normal-text"
          v-for="(text, index) in item.content"
          :key="index"
        >
          {{ text }}
        </p>
      </div>
    </div>
  </div>
</template>

<script>
import navBar from "@/components/NavBar";

export default {
  name: "PrivacyPolicy",
  components: {
    navBar,
  },
  data() {
    return {
      content: {
        title: "隐私条款",
        tip:
          "深圳青豆教育科技有限公司（以下称“说客英语”或“我们”）非常重视用户个人信息的保护。您在下载、开启、浏览、注册、登录、使用“说客英语”网站、软件及相关产品和/或服务（“产品和/或服务”）时，我们可能会收集和使用您的相关信息。我们希望通过本《隐私政策》向您说明，我们将如何收集、使用、储存和分享这些信息，以及我们为您提供的访问、更新、控制和保护这些信息的方式。本《隐私政策》与您所使用的说客英语产品和/或服务息息相关，希望您仔细阅读，在需要时，按照本《隐私政策》的指引，做出您认为适当的选择。本《隐私政策》中涉及的相关技术词汇，我们尽量使用简明扼要的表述，以便您的理解。\n" +
          "      如果您不同意本《隐私政策》关于基本业务功能的相关内容，可能将影响为您提供相应产品和/或服务的效果。您使用我们的产品和/或服务，即意味着同意我们按照本《隐私政策》收集、使用、储存和分享您的相关信息。当本《隐私政策》进行更新后，我们会及时在说客英语平台发布最新版本。\n" +
          "      如对本《隐私政策》或相关事宜有任何问题，您可以通过说客英语网站（www.talk915.com）首页的客服热线或者在线咨询与我们联系。",
        detail: [
          {
            title: "目录",
            content: [
              "一、我们如何收集、使用您的个人信息",
              "二、我们如何使用Cookies和同类技术",
              "三、我们所使用的SDK技术服务",
              "四、我们如何存储您的个人信息",
              "五、我们如何共享、转让、公开披露您的个人信息",
              "六、您的权利",
              "七、信息安全",
              "八、儿童个人信息保护",
              "九、数据存储地点",
              "十、隐私政策的适用范围",
              "十一、隐私政策的变更",
              "十二、如何联系我们",
            ],
          },
          {
            title: "一. 我们如何收集，使用您的个人信息",
            content: [
              "为了保证用户注册、课程服务、在线课程、客户服务、各项基本业务功能及个性化营销、提供个性化用户体验的各项扩展业务功能的正常运行，我们会收集、使用下列与您有关的信息。如果您不提供相关信息，可能无法注册成为我们的用户或无法使用和享受我们提供的某些产品和服务，或者无法达到相关产品和/或服务拟达到的效果。",
              "1.1 基本业务功能",
              "1)、用户注册。要使用说客英语产品和服务，当您注册说客英语账号或使用说客英语提供的产品和/或服务时， 您需要向我们提供您的手机号码、头像，学员年龄信息。我们将通过短信验证码的方式核实您的身份信息的有效性。 我们会将这些数据加密储存在安全的服务器中。",
              "2)、在线课程。为您能顺利的完成在线课程的学习，您需在课前检测您设备的网络、摄像头、麦克风功能是否正常，在使用这些功能时， 您需在设备向我们开启摄像头（相机）、麦克风功能的访问权限，您可使用这些功能与课程老师在线交流、视频互动。\n" +
                "      为了给您提供完善的产品和/或专属服务，您在使用我们的产品和/或服务时，我们将对课程进行录音录像。 在课程结束后可以回放观看。您开启这些权限即代表您授权我们可以收集和使用这些个人信息来实现上述的功能，\n" +
                "      您亦可在设备中随时关闭相应访问权限，您关闭权限即代表您取消了这些授权，则我们将不再继续收集和使用您的这些个人信息，\n" +
                "      也无法为您提供上述与这些授权所对应的功能，如您继续使用这些功能您需重新开启访问权限。您关闭权限的决定不会影响此前基于您的授权所进行的个人信息的处理。",
              "如果您提供以下额外信息，将有助于我们给您提供更好的服务和体验：头像、昵称、性别、年龄、QQ账号、SKYPE账号等。但如果您不提供这些信息，并不会影响使用本服务的基本功能。上传或更改头像时，需要使用存储和相机权限。选择地区时，需要使用位置权限。",
              "3)、客户服务。为保障您的账号安全，我们在向您提供客户服务时可能会使用您的账号信息来核实您的身份；在您需要提供客服咨询或售后服务时，我们会查询您的订单信息帮助您解决订单问题。您在与我们客服进行沟通、咨询时，我们会对通话进行录音。\n" +
                "      若您不提供这类信息，您将无法使用说客英语帐号。",
              "4)、寄送礼包。若您在使用我们的服务时，如果获得任何礼包或者通过根据任何说客英语平台发布的活动规则进行礼品兑换，为了给您寄送礼包和/或礼品，我们将收集您的收货人姓名、联系地址及手机号码",
              "1.2 扩展业务功能",
              "个性化营销：在您事先同意的情况下，我们会要求您提供您或学员个人信息，包括头像、昵称、性别、年龄、QQ账号、SKYPE账号以便提升说客英语的产品、服务、宣传成效。说客英语可能会利用此类个人信息，来制作有关用户群的整体报告，此类个人信息及整体报告皆为不具名形式，不会包含能识别您或学员的内容。",
              "提供个性化的用户体验：在您事先同意的情况下，我们将基于分析您使用我们产品和/或服务的情况、广告优化的目的，自动采集您的信息或获得系统权限，包括：在使用我们产品和/或服务时搜索或浏览的信息，包括您使用的网页搜索词语、访问的社交媒体页面url地址，以及您在使用我们产品和/或服务时浏览或要求提供的其他信息和内容详情；\n" +
                "      在您授权同意的情况下，在使用我们产品和/或服务时将相关课程信息写入您的日历。\n" +
                "      通过您使用的设备系统提供的生物识别服务，即可以用来区分您的独特生理特征，包括您的脸部识别数据和/或指纹，苹果公司的触控ID、面容ID和安卓系统中的类似技术，您理解您的生物识别信息的采集、存储和比对服务将由您使用的手机或设备及其系统来完成，我们不会保存您的此类信息。\n" +
                "      您通过我们的产品和/或服务分享的内容所包含的信息（元数据），包括拍摄或上传的照片、录音或录像的日期、时间或地点。\n" +
                "      您需知悉，上述功能为我们向您提供的扩展业务服务。我们将会在征求您同意的前提下开启上述功能，您可以选择不向我们提供上述功能实现所相关的个人信息，或者拒绝打开相应的系统权限，在此情况下您将无法体验上述服务。同时，在您开启上述业务扩展功能后，可随时通过系统设置管理、拒绝或关闭相关权限，\n" +
                "      您关闭权限即代表您取消了这些授权，我们将不再继续收集和使用您的这些个人信息，也无法为您提供上述与此授权所对应的服务和/或功能，如您继续使用这些功能您需重新开启访问权限。您关闭权限的决定不会影响此前基于您的授权所进行的个人信息的处理。在此我们保证，您未选择上述扩展业务功能，并不影响您正常使用我们为您提供的基本业务功能。",
            ],
          },
          {
            title: "二. 我们如何使用Cookies和同类技术",
            content: [
              "2.1 我们或我们的第三方合作伙伴，可能通过cookies收集和使用您的信息，并将该信息储存为日志信息。",
              "2.2 我们使用自己的cookie，目的是为您提供更个性化的用户体验产品和服务，并用于防止欺诈行为，我们需采集浏览器信息cookie；登录异常时，我们会采集图片验证码页面的鼠标或屏幕滑动信息，以验证身份。",
            ],
          },
          {
            title: "三. 我们所使用的SDK技术服务",
            content: [
              " 3.1 直播SDK",
              "为了方便学员和老师上课以及在课堂上面有一个良好的互动，App在上课途中会使用到摄像头，麦克风，还有本地使用存储的权限",
              "摄像头权限：为了学员和老师视频上课。",
              "麦克风权限：为了学员和老师语音交流。",
              "本地存储使用权限：访问本地相册，发送图片到直播间。",
              "3.2 个推SDK",
              "个推消息推送服务：为了学员及时收到上课提醒消息,需要获取设备型号以便于消息推送。",
              "获取设备信息：为了方便后台推送消息。",
              "平台将在您使用服务的过程中收集您的（Mac 地址、IMEI、Android_id、IMSI）。",
              "3.3 极光推送",
              "极光推送：为了学员及时收到上课提醒消息。平台将在您使用服务的过程中收集您的（Mac 地址、IMEI、Android_id、IMSI）",
              "极光统计：APP 应用页面及功能事件相关信息，设备信息，网络信息与位置信息。平台将在您使用服务的过程中收集您的（Mac 地址、IMEI、Android_id、IMSI）",
              "获取设备信息：为了方便后台推送消息。",
              "3.4 ShareSDK",
              "为了方便您第三方登录与第三方分享，分享到QQ微信，朋友圈。",
              "3.5 QQ互联",
              "为您可以用QQ第三方登录和QQ分享到空间和好友。",
              "3.6 微信SDK",
              "为帮助您分享到微信第三方应用，为了方便您微信第三方登录。",
              "3.7 先声SDK",
              "为了您用于口语发音测评 ，需要用到的权限：录音权限，文件写入权限 。",
              "3.8 腾讯Bugly SDK",
              "为提高服务稳定性，为帮助平台定位分析App闪退信息，以改善App功能和稳定性，平台与Bugly将在您使用服务的过程中收集并共享您的设备信息、设备厂商、设备名称、操作系统版本、运营商代码，App运行状态，闪退、卡顿、网络信息、日志信息。",
              "3.9 谷歌SDK",
              "GoogleMobile Service为您可以运行谷歌程序和服务，需要谷歌服务框架的时候可以使用。",
            ],
          },
          {
            title: "四. 我们如何存储您的个人信息",
            content: [
              "您的个人信息将在实现业务功能必要目的所需的最短时间内存储，超过该保存期限，\n" +
                "      将对个人信息进行删除或者匿名化处理。我们在中华人民共和国境内运营中收集和产生的个人信息，原则上存储在中国境内，以下情形除外；",
              "(1) 法律法规有明确规定",
              "(2) 获得您的明确授权。",
              "针对以上情形，我们会确保依据法律法规和本《隐私政策》对您的个人信息提供安全保护。",
            ],
          },
          {
            title: "五. 我们如何共享、转让、公开披露您的个人信息",
            content: [
              "5.1 共享",
              "我们不会与本公司以外的任何公司、组织和个人分享您的个人信息，除非获得您的明确同意。 目前，我们会在以下情形中，向您征求您对共享个人信息的授权同意",
              "5.2 我们的服务商",
              "我们可委任第三方服务提供者代表我们管理及/或操作功能或服务，而妥善执行该功能或服务可能需要移转您所提交的信息。我们将基于配送需求向物流公司共享您的收货人信息、地址信息及手机号， 以完成物品配送；我们还可能基于为您提供服务向服务商基于必要合理原则提供您的个人信息，以完成或提升为您提供的服务",
              "5.3 公开",
              "我们可能会根据法律法规规定，或按政府主管部门的强制性要求，对外共享您的个人信息。对于共享您个人信息的公司、组织和个人，我们会与其签署严格的保密协定，\n" +
                "        要求他们按照我们的要求、本隐私政策以及其他任何相关的保密和安全措施来处理个人信息",
              "5.4 转让",
              "我们不会将您的个人信息转让给任何公司、组织和个人，但以下情况除外：",
              "1)在获取明确同意的情况下转让：获得您的明确同意后，我们会向其他方转让您的个人信息；",
              "2)在涉及合并、收购或破产清算时，如涉及到个人信息转让，我们会在要求新的持有您个人信息的公司、组织继续受此隐私政策的约束，否则我们将要求该公司、组织重新向您征求授权同意。",
              "5.5 公开披露",
              "我们仅会在以下情况下，公开披露您的个人信息：",
              "1)获得您明确同意后。",
              "2)基于法律的披露：在法律、法律程序、诉讼或政府主管部门强制性要求的情况下，我们可能会公开披露您的个人信息。",
            ],
          },
          {
            title: "六. 您的权利",
            content: [
              "您对于自己的个人信息享有的权利，按照中国相关的法律、法规、标准，以及其他国家、地区的通行做法，我们保障您对自己的个人信息行使以下权利",
              "6.1 查询您的个人信息",
              "您有权查询您的个人信息，法律法规规定的例外情况除外。如果您想行使数据访问权，可以通过登录自己的账户查看或修改账户设置和信息",
              "6.2 更正您的个人信息",
              "我们可委任第三方服务提供者代表我们管理及/或操作功能或服务，而妥善执行该功能或服务可能需要移转您所提交的信息。我们将基于配送需求向物流公司共享您的收货人信息、地址信息及手机号， 以完成物品配送；我们还可能基于为您提供服务向服务商基于必要合理原则提供您的个人信息，以完成或提升为您提供的服务",
              "6.3 删除您的个人信息",
              "1)在以下情形中，您可以向我们提出删除个人信息的请求；",
              "2)如果我们处理个人信息的行为违反法律法规；",
              "3)如果我们收集、使用您的个人信息，却未征得您的同意；",
              "4)如果我们处理个人信息的行为违反了与您的约定；",
              "5)如果您不再使用我们的产品或服务，或您注销了账号；",
              "6)如果我们终止了产品或服务。",
              "您可以通过说客英语网站（www.talk915.com）首页的客服热线提出您的删除请求。若我们决定响应您的删除请求，\n" +
                "        我们还将同时通知从我们获得您的个人信息的实体，要求其及时删除，除非法律法规另有规定，或这些实体获得您的独立授权。",
              "当您从我们的服务中删除信息后，我们可能不会立即备份系统中删除相应的信息，但会在备份更新时删除这些信息。",
              "6.4 改变您授权同意的范围",
              "每个基本业务功能需要一些基本的个人信息才能得以完成。对于为了实现扩展业务功能之目的而收集的个人信息的收集和使用 ，您可以随时给予或收回您的授权同意，您可以通过设备系统权限设置对于您的授权进行管理。",
              "当您收回同意后，我们将不再处理相应的个人信息。但您收回同意的决定，不会影响此前基于您的授权而开展的个人信息处理。",
              "6.5 个人信息主体注销账户",
              "您可通过登录说客英语app“我的”中自行注销账号，在注销账户之后，我们将停止为您提供产品或服务，并依据您的要求，删除您的个人信息，法律法规另有规定的除外。",
              "6.6 响应您的请求",
              "为保障安全，您可能需要提供书面请求，或以其他方式证明您的身份。我们可能会先要求您验证自己的身份，然后再处理您的请求。我们将在十五天内作出答复。如您不满意，您可以通过说客英语网站（www.talk915.com）首页的客服热线或者在线咨询进行投诉，我们将在15天内给您答复。对于您合理的请求，我们原则上不收取费用，但对多次重复、超出合理限度的请求，我们将视情收取一定成本费用。对于那些无端重复、\n" +
                "        需要过多技术手段（需要开发新系统或从根本上改变现行惯例）、给他人合法权益带来风险或者非常不切实际（涉及备份磁带上存放的信息）的请求，我们可能会予以拒绝。",
              "6.7 无法响应您的请求的情形",
              "在以下情形中，我们将无法响应您的请求：",
              "1)与个人信息控制者履行法律法规规定的义务相关的；",
              "2)与国家安全、国防安全直接相关的；",
              "3)与公共安全、公共卫生、重大公共利益直接相关的；",
              "4)与犯罪侦查、起诉、审判和执行判决直接相关的；",
              "5)个人信息控制者有充分证据表明个人信息主体存在主观恶意或滥用权利的；",
              "6)为了维护个人信息主体或其他个人的生命、财产重大合法权益但又很难得到本人同意的；",
              "7)响应个人信息主体的请求将导致个人信息主体或其他个人、组织的合法权益受到严重损害的；",
              "8)涉及商业秘密的。",
            ],
          },
          {
            title: "七. 信息安全",
            content: [
              "平台如何保护您的个人信息 7.1 平台会采取各种预防措施来保护您的个人信息，以保障您的个人信息免遭丢失、盗用和误用，以及被擅自取阅、披露、更改或销毁。为确保您个人信息的安全，\n" +
                "      平台有严格的信息安全规定和流程，并有专门的信息安全团队在公司内部严格执行上述措施。",
              "7.2说客英语有行业先进的以数据为核心，围绕数据生命周期进行的数据安全管理体系，从组织建设、制度设计、人员管理、产品技术等方面多维度提升整个系统的安全性",
              "7.3平台会采取合理可行的措施，尽力避免收集无关的个人信息，并在限于达成本政策所述目的所需的期限内保留您的个人信息，除非需要延长保留期限或在法律的允许期限内。\n" +
                "      平台会采取合理可行的措施，尽力避免收集无关的个人信息，并在限于达成本政策所述目的所需的期限内保留您的个人信息，除非需要延长保留期限或在法律的允许期限内",
              "7.4如发生个人信息安全事件后，平台将按照法律法规的要求并最迟不迟于30 个自然日内向您告知：安全事件的基本情况和可能的影响、平台已采取或将要采取的处置措施、您可自主防范和降低风险的建议、对您的补救措施等。\n" +
                "      事件相关情况平台将以邮件、信函、电话、推送通知等方式告知您，难以逐一告知个人信息主体时，平台会采取合理、有效的方式发布公告。同时，平台还将按照监管部门要求，上报个人信息安全事件的处置情况",
              "7.5 由于技术的限制以及可能存在的各种恶意手段，在互联网行业，即便竭尽所能加强安全措施，也不可能始终保证信息百分之百的安全，\n" +
                "      我们将尽力确保您提供给我们的个人信息的安全性。请您知悉并理解，您接入我们的服务所用的系统和通讯网络，有可能因我们可控范围外的因素而出现问题。因此，我们强烈建议您采取积极措施保护个人信息的安全，包括但不限于使用复杂密码、定期修改密码、不将自己的账号密码等个人信息透露给他人。\n" +
                "      在登录时，说客英语也坚持使用密码，避免您的个人资料档案及学习记录在未经授权的状况下被存取。",
              "您在使用说客英语产品和/或服务时，请妥善保管好您的说客英语账号及其密码，我们会通过您的账号及其密码来识别您的身份。一旦您泄漏了说客英语账号及其密码，您可能会丢失您的信息，并可能产生对您不利的法律后果。\n" +
                "      如您发现说客英语账号及其密码因任何原因已经或将受到泄漏时，请您立即联络我们客服，以便我们采取相应措施。但在我们知悉此种情况和在合理时间内采取行动前，我们对此不负任何责任。",
              "在不幸发生个人信息安全事件后，我们将按照法律法规的要求向您告知：安全事件的基本情况和可能的影响、我们已采取或将要采取的处置措施、您可自主防范和降低风险的建议、对您的补救措施。事件相关情况我们将以邮件、电话、推送通知方式告知您，难以逐一告知个人信息主体时，\n" +
                "      我们会采取合理、有效的方式发布公告。同时，我们还将按照监管部门要求，及时上报个人信息安全事件的处置情况。",
            ],
          },
          {
            title: "八. 儿童个人信息保护",
            content: [
              "我们了解，我们所收集、处理的学员个人信息可能来自14周岁以下未成年人（“儿童”），我们非常重视对儿童个人信息的保护。对此，我们严格按照《中华人民共和国网络安全法》、《儿童个人信息网络保护规定》国内个人信息保护的相关规定，落实保护责任，作出以下承诺：",
              "8.1 未经监护人同意，儿童不得创建自己的说客英语用户账户",
              "8.2 在收集儿童个人信息前，我们将提醒儿童及其监护人阅读本《隐私政策》，向其告知我们收集、处理儿童个人信息的场景，以及我们所采取的信息安全保护措施",
              "8.3 我们将仅在获取儿童监护人授权同意的前提下收集、处理儿童个人信息，且严格按照法律规定在监护人同意或者在保护儿童所必要的情况下处理这部分个人信息",
              "8.4 我们已为儿童及其监护人提供拒绝上述收集、处理行为的方式。儿童及其监护人可以通过本《隐私政策》第11条所附联系方式与我们取得联系，表达具体的拒绝意向，我们会在做好身份识别的基础上进行处理",
              "8.5 一般情况下，我们不会收集与实现本隐私政策所描述相应功能场景无关的个人信息；如因业务需要，确需超出约定的目的、范围收集、处理的，我们会具体告知儿童监护人并征得其同意",
              "8.6 我们会严格设定不同功能下的信息访问权限 ，控制儿童个人信息知悉范围",
              "8.7 儿童及其监护人同样享有本《隐私政策》第5条所描述的个人信息主体的权利",
              "8.8 按照国内个人信息相关法律法规及标准要求、本《隐私政策》展现的存储要求及保护措施，保障儿童个人信息安全",
              "8.9 为更好的保护未成年人信息保护，我们会指定专人负责儿童个人信息保护事宜，如有相关疑问可发送邮件至第11条所附联系方式与我们联系",
            ],
          },
          {
            title: "九. 数据存储地点",
            content: [
              "我们在本服务项下收集和产生的个人信息，将存储在中华人民共和国境内",
            ],
          },
          {
            title: "十. 隐私政策的适用范围",
            content: [
              "除某些特定产品和服务外，我们所有的产品和/或服务均适用本《隐私政策》。这些特定产品和服务将适用特定的隐私政策。针对某些特定产品和服务的特定隐私政策，将更具体地说明我们在该产品和服务中如何使用您的信息。该特定产品和/或服务的隐私政策构成本《隐私政策》的一部分。\n" +
                "      如相关特定服务的隐私政策与本《隐私政策》有不一致之处，适用该特定产品和/或服务的隐私政策",
              "请您注意，本《隐私政策》仅适用于我们所收集、保存、使用、共享、披露信息。除非本《隐私政策》另有明确所指，本《隐私政策》不适用于以下情况：",
              "10.1 通过我们的产品和/或服务而接入的第三 方服务（包括任何第三方网站）收集的信息；",
              "10.2 通过在我们产品和/或服务中进行广告服务的其他公司或机构所收集的信息。 请您知悉：如果您浏览第三方网站或使用第三方的产品和／或服务时向该第三方提供您的个人信息，您的信息应当适用该第三方的隐私声明或类似政策，\n" +
                "      我们对任何第三方不当使用或披露由您提供的信息不承担任何法律责任，无论您登录或浏览上述网站、软件，或使用其产品和/或服务是否基于说客英语的链接或引导。",
            ],
          },
          {
            title: "十一. 隐私政策的变更",
            content: [
              "我们可能适时修订本《隐私政策》的条款，该修订构成本《隐私政策》的一部分。如该修订造成您在本《隐私政策》下权利的实质减少，我们将在修订生效前通过在主页上显著位置提示或通过其他我们认为合适的方式（包括向您发送电子邮件或以其他方式通知您）发布对本《隐私政策》所做的变更。\n" +
                "      在该种情况下，若您继续使用我们的产品和/或服务，即表示同意受经修订的本《隐私政策》的约束。",
            ],
          },
          {
            title: "十二. 如何联系我们",
            content: [
              "我们设立了个人信息保护专职部门，如果您对本隐私政策有任何疑问、意见或建议，通过以下方式与我们联系： 通过说客英语网站（www.talk915.com）首页的客服热线或者在线咨询。一般情况下，我们将在十五天内回复。",
              "如果您对我们的回复不满意，特别是我们的个人信息处理行为损害了您的合法权益，您还可以通过教委、网信、电信、工商监管部门寻求解决方案。",
              "公司地址：深圳市南山区南头街道马家龙社区大新路198号创新大厦B栋1002",
              "联系电话：400-990-9915",
              "隐私条款修订日期：2020年 11月3日",
              "版本生效日期：2020年 11月3日",
            ],
          },
        ],
      },
    };
  },
  methods: {},
};
</script>

<style scoped lang="less">
.agreement {
  padding-top: 3rem;
  margin: 1rem 1rem;

  .title {
    font-size: 1.867rem;
    color: #333333;
    line-height: 1.867rem;
    margin-bottom: 2.133rem;
    text-align: justify;
    font-weight: 700;
  }

  .first-title {
    font-size: 1.067rem;
    color: #333333;
    line-height: 1.5rem;
    text-align: justify;
    margin-bottom: 1.667rem;
    margin-top: 1.667rem;
    font-weight: 700;
  }

  .normal-text {
    font-size: 0.933rem;
    font-weight: 400;
    color: #606266;
    line-height: 1.333rem;
    text-align: justify;
    margin-bottom: 1rem;
  }
}
</style>
